tutorials/incompressibleVoF/planingHullW3/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");
writeControl    runTime;
writeInterval   0.02;

surfaceFormat   vtk;
writeFormat     binary;
fields          (alpha.water);

interpolationScheme cellPoint;

surfaces
{
    iso-alpha
    {
        type            isoSurface;
        isoField        alpha.water;
        isoValue        0.5;
        interpolate     true;
    }

    hull
    {
        type            patch;
        patches         (hull);
        interpolate     true;
    }
}

// ************************************************************************* //
